from itertools import product

# Создаем словарь с возможными заменами для каждой цифры
neighbors = {'1': ['1', '2'], '2': ['1', '2', '3'], '3': ['2', '3'],
             '4': ['4', '5'], '5': ['4', '5', '6'], '6': ['5', '6'],
             '7': ['7', '8'], '8': ['7', '8', '9'], '9': ['8', '9'],
             '0': ['0']}

# Задаем наблюдаемый ПИН-код
observed = '137890'

# Вычисляем все возможные комбинации цифр
possible_pins = list(product(*[neighbors[d] for d in observed]))

# Выводим количество всех возможных вариантов кодов
print(len(possible_pins))